local M = {}

-- rewrite defaults with user settings
local defaults = require("floating_weather.config")
M.config = vim.deepcopy(defaults)
function M.setup(opts)
	M.config = vim.tbl_deep_extend("force", M.config, opts or {})
end

local weather = {
	feels_like = "",
	temperature = "",
	cloud_cover = "",
	pressure = "",
	uv_index = "",
	wind_speed = "",
	weather_code = "",
}

local function getWeather(city, weather)
	local p = io.popen(string.format("curl -s https://wttr.in/%s?format=j2", city))
	local raw = p:read("all")
	p.close()
	local json_data = vim.json.decode(raw).current_condition[1]

	weather.feels_like = json_data.FeelsLikeC
	weather.temperature = json_data.temp_C
	weather.cloud_cover = json_data.cloudcover
	weather.pressure = json_data.pressure
	weather.uv_index = json_data.uvIndex
	weather.wind_speed = json_data.windspeedKmph
	weather.weather_code = json_data.weatherCode

	return weather
end

local weather_code_map = {
	[395] = "Умеренный или сильный снегопад в районе с грозой",
	[392] = "Местами небольшой снег в районе с грозой",
	[389] = "Умеренный или сильный дождь в районе с грозой",
	[386] = "Местами небольшой дождь с грозой",
	[377] = "Умеренный или сильный дождь из ледяных гранул",
	[374] = "Небольшой дождь из ледяных гранул",
	[371] = "Умеренный или сильный снегопад",
	[368] = "Небольшой снегопад",
	[365] = "Умеренный или сильный дождь с мокрым снегом",
	[362] = "Небольшой дождь с мокрым снегом",
	[359] = "Проливной дождь",
	[356] = "Умеренный или сильный ливень",
	[353] = "Легкий дождевой душ",
	[350] = "Ледяные крошки",
	[338] = "Сильный снег",
	[335] = "Неравномерный сильный снег",
	[332] = "Умеренный снег",
	[329] = "Неравномерный умеренный снег",
	[326] = "Легкий снег",
	[323] = "Слабый снежный покров",
	[320] = "Умеренный или сильный мокрый снег",
	[317] = "Небольшой мокрый снег",
	[314] = "Умеренный или сильный ледяной дождь",
	[311] = "Небольшой ледяной дождь",
	[308] = "Сильный дождь",
	[305] = "Временами идет сильный дождь",
	[302] = "Умеренный дождь",
	[299] = "Временами умеренный дождь",
	[296] = "Небольшой дождь",
	[293] = "Кратковременный слабый дождь",
	[284] = "Сильный моросящий дождь",
	[281] = "Моросящий мелкий дождь",
	[266] = "Легкий моросящий дождь",
	[263] = "Кратковременный мелкий моросящий дождь",
	[260] = "Ледяной туман",
	[248] = "Туман",
	[230] = "Метель",
	[227] = "Метущий снег",
	[200] = "Вспышки грозы поблизости",
	[185] = "Кратковременный ледяной дождь поблизости",
	[182] = "Кратковременный мокрый снег поблизости",
	[179] = "Кратковременный снег поблизости",
	[176] = "Кратковременный дождь поблизости",
	[143] = "Туман",
	[122] = "Пасмурно",
	[119] = "Облачно",
	[116] = "Переменная облачность",
	[113] = "Ясно/солнечно",
}
function M.toggle()
    vim.print(1)
end

return M

